In [ ]:
'''
Author      :  PONNAM SRI SAI
Created on  :  12 Feb 2026 05:22:14
Purpose     :
'''

'\nAuthor      :  PONNAM SRI SAI\nCreated on  :  12 Feb 2026 05:22:14\nPurpose     :  \n'

# loading

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv('Week1_GA_dataset.csv')

In [ ]:
df.sample(3)

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
220,2009-04-04,2009,Norwalk,NaN,1550000.0,Single Family,Detached House,3,2,1099.0,1.025953,North
6370,2018-06-28,2018,Norwalk,425780.0,595000.0,Single Family,Detached House,3,2,965.0,1.422308,North
5716,2017-07-14,2017,Waterbury,86310.0,99500.0,Single Family,Detached House,3,2,NaN,1.388283,West

In [ ]:
df.shape

(10000, 12)

In [ ]:
df.columns

Index(['Date', 'Year', 'Locality', 'Estimated Value', 'Sale Price', 'Property',
       'Residential', 'num_rooms', 'num_bathrooms', 'carpet_area',
       'property_tax_rate', 'Face'],
      dtype='object')

In [ ]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
df.columns

Index(['date', 'year', 'locality', 'estimated_value', 'sale_price', 'property',
       'residential', 'num_rooms', 'num_bathrooms', 'carpet_area',
       'property_tax_rate', 'face'],
      dtype='object')

In [ ]:
df.describe()

,year,estimated_value,sale_price,num_rooms,num_bathrooms,carpet_area,property_tax_rate
count,10000.000000,8.757000e+03,1.000000e+04,10000.000000,10000.000000,8771.000000,10000.000000
mean,2015.904900,4.377749e+05,6.129367e+05,3.335000,2.326400,1115.160871,1.148257
std,4.045725,7.799885e+05,1.102810e+06,0.886258,1.207977,308.026850,0.168458
min,2009.000000,9.800000e+02,2.000000e+03,3.000000,1.000000,900.000000,1.003979
25%,2012.000000,1.280300e+05,1.560000e+05,3.000000,1.000000,960.000000,1.023495
50%,2016.000000,2.300200e+05,3.250000e+05,3.000000,2.000000,1021.000000,1.025899
75%,2019.000000,4.253200e+05,6.150000e+05,3.000000,3.000000,1083.000000,1.348259
max,2022.000000,2.111991e+07,2.575000e+07,8.000000,8.000000,2989.000000,1.422308

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               10000 non-null  object
 1   year               10000 non-null  int64
 2   locality           8747 non-null   object
 3   estimated_value    8757 non-null   float64
 4   sale_price         10000 non-null  float64
 5   property           10000 non-null  object
 6   residential        10000 non-null  object
 7   num_rooms          10000 non-null  int64
 8   num_bathrooms      10000 non-null  int64
 9   carpet_area        8771 non-null   float64
 10  property_tax_rate  10000 non-null  float64
 11  face               10000 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 937.6+ KB

In [ ]:
df.isna().sum()

date                    0
year                    0
locality             1253
estimated_value      1243
sale_price              0
property                0
residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
face                    0
dtype: int64

# 1

How many unknown ("?) values are present in the dataset? Remove/Delete unknown ("?) values present in the dataset to make it null value.
Remove/Delete - means it will show NAN in place of "?"

Note: If there is no value present in the dataset it is represented as NAN(read pandas documentation for all the other ways to represent null values) in data

In [ ]:
df_nan = df.isin(['?']).sum()
df_nan

date                    0
year                    0
locality                0
estimated_value         0
sale_price              0
property             1823
residential             0
num_rooms               0
num_bathrooms           0
carpet_area             0
property_tax_rate       0
face                    0
dtype: int64

In [ ]:
df_nan.sum()

np.int64(1823)

In [ ]:
df.replace('?', np.nan, inplace=True)
df.isin(['?']).sum()

date                 0
year                 0
locality             0
estimated_value      0
sale_price           0
property             0
residential          0
num_rooms            0
num_bathrooms        0
carpet_area          0
property_tax_rate    0
face                 0
dtype: int64

In [ ]:
df.sample(3)

,date,year,locality,estimated_value,sale_price,property,residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,face
6098,2017-12-23,2017,Waterbury,60250.0,88000.0,Single Family,Detached House,3,1,1067.0,1.388283,South
4788,2016-07-02,2016,Stamford,308850.0,480000.0,Single Family,Detached House,3,2,1042.0,1.348259,East
6647,2018-11-15,2018,Bridgeport,NaN,50000.0,Single Family,Detached House,3,3,1005.0,1.422308,North

# 2

What is the shape of the dataset ?

In [ ]:
df.sample(3)

,date,year,locality,estimated_value,sale_price,property,residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,face
2464,2012-11-15,2012,West Hartford,208400.0,363000.0,Single Family,Detached House,3,1,939.0,1.021958,South
5145,2016-11-24,2016,Norwalk,280700.0,385000.0,Single Family,Detached House,3,2,910.0,1.348259,North
9994,2022-09-30,2022,NaN,155550.0,215000.0,Three Family,Triplex,6,5,2114.0,1.003979,North

In [ ]:
df.shape

(10000, 12)

# 3

What is the value present at the 692th indexed row and 0th indexed column in the data ?

dataframe[692,0] (simpy saying this in a matrix)
rows/ columns starts indexing from zero(0) in python

In [ ]:
df.iat[692, 0]

'2009-11-16'

# 4

What is the value present at the 546th indexed row and 7th indexed column in the data ?
 dataframe[546,7] (simpy saying this in a matrix)
 rows/ columns starts indexing from zero(0) in python

In [ ]:
df.iat[546, 7]

np.int64(3)

# 5

What are the unique values present in the Locality feature of the dataset?

In [ ]:
sorted(df['locality'].dropna().unique())

['Bridgeport',
 'Fairfield',
 'Greenwich',
 'Norwalk',
 'Stamford',
 'Waterbury',
 'West Hartford']

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               10000 non-null  object
 1   year               10000 non-null  int64
 2   locality           8747 non-null   object
 3   estimated_value    8757 non-null   float64
 4   sale_price         10000 non-null  float64
 5   property           8177 non-null   object
 6   residential        10000 non-null  object
 7   num_rooms          10000 non-null  int64
 8   num_bathrooms      10000 non-null  int64
 9   carpet_area        8771 non-null   float64
 10  property_tax_rate  10000 non-null  float64
 11  face               10000 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 937.6+ KB

#6

Which of the following features have missing(NaN) values present in the dataset?

(Note: compute after removing "?")

In [ ]:
df.isna().sum()

date                    0
year                    0
locality             1253
estimated_value      1243
sale_price              0
property             1823
residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
face                    0
dtype: int64

# 7

Which of the following feature has most missing(NaN) values present in the dataset?

 (Note: compute after removing "?")

In [ ]:
df.isna().sum()

date                    0
year                    0
locality             1253
estimated_value      1243
sale_price              0
property             1823
residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
face                    0
dtype: int64

In [ ]:
df.isna().sum().idxmax()

'property'

# 8

Drop all the samples(rows) with missing values strictly greater than 2. How many samples remains after that ?

 (Note: compute after removing "?")

In [ ]:
df_clean = df.dropna(thresh = df.shape[1] - 2)
df_clean.shape

(9917, 12)

# 9

Drop all the samples(rows) with missing values in the original dataframe. How many samples remains after that ?

 (Note: compute after removing "?")

In [ ]:
df.dropna(inplace = True)
df.shape

(5449, 12)